# RemovingInvalidDPartParents Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..RemovingInvalidDPartParents Property
BuiltInFailures..::..DPartFailures Class See Also
---
Can't make Parts out of these Elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RemovingInvalidDPartParents { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RemovingInvalidDPartParents As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RemovingInvalidDPartParents {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace